###############################################################################
# Created by write_sdc
###############################################################################
current_design counter
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 5.0000 [get_ports {clk}]
set_clock_transition 0.1000 [get_clocks {clk}]
set_clock_uncertainty 0.0050 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr00[0]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr00[1]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr00[2]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr00[3]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr00[4]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr00[5]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr00[6]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr00[7]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr01[0]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr01[1]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr01[2]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr01[3]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr01[4]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr01[5]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr01[6]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr01[7]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {csb00}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {csb01}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din00[0]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din00[10]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din00[11]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din00[12]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din00[13]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din00[14]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din00[15]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din00[1]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din00[2]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din00[3]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din00[4]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din00[5]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din00[6]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din00[7]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din00[8]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din00[9]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din01[0]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din01[10]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din01[11]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din01[12]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din01[13]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din01[14]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din01[15]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din01[1]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din01[2]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din01[3]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din01[4]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din01[5]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din01[6]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din01[7]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din01[8]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din01[9]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 2.2500 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[0]}]
set_output_delay 2.2500 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[10]}]
set_output_delay 2.2500 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[11]}]
set_output_delay 2.2500 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[12]}]
set_output_delay 2.2500 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[13]}]
set_output_delay 2.2500 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[14]}]
set_output_delay 2.2500 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[15]}]
set_output_delay 2.2500 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[1]}]
set_output_delay 2.2500 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[2]}]
set_output_delay 2.2500 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[3]}]
set_output_delay 2.2500 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[4]}]
set_output_delay 2.2500 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[5]}]
set_output_delay 2.2500 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[6]}]
set_output_delay 2.2500 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[7]}]
set_output_delay 2.2500 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[8]}]
set_output_delay 2.2500 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {sine_out[15]}]
set_load -pin_load 0.0334 [get_ports {sine_out[14]}]
set_load -pin_load 0.0334 [get_ports {sine_out[13]}]
set_load -pin_load 0.0334 [get_ports {sine_out[12]}]
set_load -pin_load 0.0334 [get_ports {sine_out[11]}]
set_load -pin_load 0.0334 [get_ports {sine_out[10]}]
set_load -pin_load 0.0334 [get_ports {sine_out[9]}]
set_load -pin_load 0.0334 [get_ports {sine_out[8]}]
set_load -pin_load 0.0334 [get_ports {sine_out[7]}]
set_load -pin_load 0.0334 [get_ports {sine_out[6]}]
set_load -pin_load 0.0334 [get_ports {sine_out[5]}]
set_load -pin_load 0.0334 [get_ports {sine_out[4]}]
set_load -pin_load 0.0334 [get_ports {sine_out[3]}]
set_load -pin_load 0.0334 [get_ports {sine_out[2]}]
set_load -pin_load 0.0334 [get_ports {sine_out[1]}]
set_load -pin_load 0.0334 [get_ports {sine_out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {csb00}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {csb01}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr00[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr00[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr00[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr00[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr00[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr00[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr00[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr00[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr01[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr01[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr01[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr01[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr01[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr01[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr01[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr01[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din00[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din00[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din00[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din00[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din00[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din00[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din00[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din00[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din00[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din00[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din00[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din00[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din00[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din00[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din00[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din00[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din01[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din01[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din01[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din01[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din01[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din01[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din01[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din01[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din01[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din01[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din01[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din01[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din01[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din01[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din01[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din01[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.5000 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
